<script>
export default {
    props: {
        task: {
            type: Object
        }
    }
}
</script>

<template>
    <li class="item">
        <div class="desc">
            <span :class="{ 'performed': task.status == 'завершена' }">{{ task.name }}
                <svg class="new" :class="{ 'none': task.status != 'новая' }" version="1.0"
                    xmlns="http://www.w3.org/2000/svg" width="50" height="50" viewBox="0 0 512.000000 512.000000"
                    preserveAspectRatio="xMidYMid meet">
                    <g transform="translate(0.000000,512.000000) scale(0.100000,-0.100000)" fill="red" stroke="none">
                        <path d="M303 4159 c-114 -22 -220 -106 -269 -212 l-29 -62 0 -1325 0 -1325
29 -63 c37 -80 122 -161 203 -194 l58 -23 2225 -3 c1571 -2 2244 1 2291 8 119
20 218 96 273 210 l31 65 0 1325 0 1325 -31 65 c-53 112 -151 188 -268 209
-72 13 -4447 14 -4513 0z m1178 -1511 l124 -423 3 423 2 422 105 0 105 0 0
-510 0 -510 -169 0 -169 0 -15 48 c-120 404 -242 792 -249 792 -4 0 -8 -189
-8 -420 l0 -420 -105 0 -105 0 0 510 0 510 178 0 179 0 124 -422z m1229 332
l0 -90 -230 0 -231 0 3 -117 3 -118 183 -3 183 -2 -3 -88 -3 -87 -182 -3 -183
-2 0 -120 0 -120 230 0 230 0 0 -90 0 -90 -335 0 -335 0 0 510 0 510 335 0
335 0 0 -90z m366 -328 c34 -227 64 -416 68 -419 3 -4 8 -4 11 -1 5 4 185 818
185 833 0 3 55 5 123 5 l122 0 89 -412 c82 -380 97 -440 110 -427 5 4 126 803
126 827 0 9 31 12 110 12 69 0 110 -4 110 -10 0 -6 -43 -234 -95 -506 -52
-273 -95 -498 -95 -500 0 -2 -71 -4 -158 -4 l-159 0 -31 148 c-17 81 -52 252
-78 380 -27 128 -51 227 -53 220 -2 -7 -39 -177 -80 -378 l-76 -365 -157 -3
c-143 -2 -157 -1 -162 15 -3 10 -46 234 -96 498 -50 264 -93 486 -95 493 -4 10 20 12 107 10 l112 -3 62 -413z" />
                    </g>
                </svg>
                <svg class="in_work" :class="{ 'none': task.status != 'в работе' }" version="1.0"
                    xmlns="http://www.w3.org/2000/svg" width="40" height="40" viewBox="0 0 512.000000 512.000000"
                    preserveAspectRatio="xMidYMid meet">
                    <g transform="translate(0.000000,512.000000) scale(0.100000,-0.100000)" fill="#000000"
                        stroke="none">
                        <path d="M2325 4843 c-94 -9 -282 -46 -392 -77 -484 -140 -904 -429 -1203
-828 -502 -671 -601 -1555 -260 -2320 55 -123 165 -313 240 -412 l51 -68 -68
8 c-37 5 -105 9 -150 9 -80 0 -83 -1 -118 -35 -42 -40 -60 -93 -51 -144 8 -41
58 -103 94 -117 34 -13 599 -89 660 -89 57 0 106 28 134 76 13 22 30 117 58
329 46 344 48 387 20 433 -59 96 -211 97 -269 1 -17 -27 -24 -61 -47 -236 l-6
-42 -23 27 c-54 64 -161 241 -214 354 -127 268 -179 486 -188 784 -10 342 46
615 187 912 294 616 879 1032 1565 1113 65 8 164 9 290 5 246 -9 253 -9 288
12 53 31 72 66 72 135 0 49 -5 69 -23 95 -32 45 -65 59 -163 72 -77 9 -391 11
-484 3z" />
                        <path d="M3910 4327 c-60 -40 -66 -60 -109 -387 -23 -168 -41 -325 -41 -350 0
-53 34 -111 80 -135 44 -23 121 -19 160 8 53 35 69 73 87 206 l16 120 32 -42
c402 -526 506 -1252 270 -1882 -97 -258 -236 -475 -439 -684 -270 -276 -602
-462 -977 -545 -182 -40 -301 -50 -509 -41 -102 4 -200 7 -218 7 -43 -1 -91
-30 -120 -73 -20 -28 -23 -44 -20 -90 5 -65 31 -109 81 -132 112 -54 571 -48
832 9 450 100 835 311 1156 634 354 357 583 832 645 1337 21 179 14 495 -15
654 -66 363 -206 695 -403 961 -66 88 -70 84 74 64 116 -17 161 -8 207 36 78
76 58 203 -39 253 -30 15 -594 95 -672 95 -30 0 -56 -7 -78 -23z" />
                        <path d="M1805 3980 c-111 -36 -207 -133 -240 -243 -21 -69 -21 -443 0 -540
21 -99 76 -226 139 -320 59 -90 172 -204 249 -252 79 -50 76 -81 -14 -140 -83
-55 -204 -185 -263 -283 -27 -45 -65 -128 -85 -184 l-36 -103 -3 -237 c-3
-194 -1 -247 12 -292 33 -114 129 -210 245 -246 60 -19 93 -20 751 -20 658 0
691 1 751 20 115 35 211 132 244 243 21 69 21 443 0 540 -21 99 -76 226 -139
320 -59 90 -172 204 -249 252 -75 48 -75 82 0 130 132 83 273 258 339 420 58
140 66 200 62 455 -3 221 -4 226 -30 283 -37 78 -120 158 -195 189 l-58 23
-710 2 c-678 2 -713 1 -770 -17z m1430 -316 c14 -15 16 -42 13 -218 l-3 -201
-32 -75 c-48 -111 -123 -203 -235 -287 -132 -99 -188 -196 -188 -323 0 -127
56 -224 188 -323 112 -84 187 -176 235 -287 l32 -75 3 -201 c3 -176 1 -203
-13 -218 -15 -14 -77 -16 -675 -16 -585 0 -660 2 -674 16 -13 13 -16 46 -16
202 0 172 2 193 25 255 47 136 138 252 263 336 77 52 126 116 152 200 25 80
25 142 0 222 -26 84 -75 148 -152 200 -125 84 -216 200 -263 336 -23 62 -25
83 -25 255 0 156 3 189 16 202 14 14 89 16 674 16 598 0 660 -2 675 -16z" />
                    </g>
                </svg>
            </span>
            <div>
                <button><router-link class="link" :to="`/tasks/${task.id}`">Подробнее</router-link></button>
            </div>
        </div>
        <ul class="settings">
            <li>Статус: {{ task.status }}</li>
            <li>Приоритет: {{ task.priority }}</li>
            <li>Срок выполнения: {{ task.date }}</li>
        </ul>
    </li>

</template>

<style scoped>
.link {
    font-size: 17px;
    font-weight: 600;
    color: #323232;
    text-decoration: none;
}

.none {
    display: none;
}

.new {
    animation: new 2s ease-in-out infinite;
}

@keyframes new {
    50% {
        transform: scale(1.2);
    }
}

.in_work {
    animation: in_work 1s ease-in-out infinite;
}

@keyframes in_work {
    to {
        transform: rotate(-180deg);
    }
}

span {
    display: flex;
    align-items: center;
    gap: 20px;
}

.settings>li {
    list-style: none;
    padding: 20px;
    border-radius: 20px;
}

.desc {
    background-color: antiquewhite;
    padding: 20px;
    border-radius: 20px;
    box-shadow: 0 3px black;
}

.desc,
.settings {
    width: 100%;
    display: flex;
    flex-wrap: wrap;
    flex-direction: row;
    justify-content: space-between;
    align-items: center;
    gap: 20px;
}

.performed {
    text-decoration: line-through;
}

.item {
    display: flex;
    flex-direction: column;
    justify-content: space-between;
    align-items: center;
    list-style: none;
    font-weight: 600;
    font-size: 20px;
    margin-bottom: 20px;
    background-color: aliceblue;
    border-radius: 20px;
    border: 2px solid black;
}
</style>